<?php

return [
    'attempt_logger'            => 'خطا هنگام ثبت ورود SSO در پایگاه داده',
    'callback_response'         => 'خطا هنگام دریافت توکن اعتبارسنجی از سرور SSO',
    'certificate_provider'      => 'هیچ پاسخی برای دریافت گواهی اعتبارسنجی از سرور SSO دریافت نشد.',
    'configuration'             => 'یک یا چند پارامتر پیکربندی تنظیم نشده است.',
    'invalid_attempt'           => 'ورود شما به سیستم قابل شناسایی نیست.',
    'invalid_callback_response' => 'پاسخ دریافت شده از سرور معتبر نیست.',
    'invalid_token'             => 'توکن ارسال شده معتبر نیست.',
    'invalid_user'              => 'کاربر مورد نظر در این سیستم تعریف نشده است.',
    'login_exception'           => 'خطا هنگام انجام عملیات ورود به سیستم',
    'remote_configuration'      => 'هیچ پاسخی برای دریافت پیکربندی از سرور SSO دریافت نشد.',
    'token_parser'              => 'توکن ارسال شده توسط سیستم قابل پردازش نیست.',
    'token_verification'        => 'خطا هنگام پردازش توکن دریافت شده از سرور SSO',
    'user_getter'               => 'خطا هنگام شناسایی کاربر',
    'unhandled_exception'       => 'عملیات ورود SSO با خطا مواجه شد.',
];
